# Brewfile of meinside@gmail.com
#
# Usage: 
#
# $ brew tap Homebrew/bundle
# $ brew bundle
# 
# last update: 2019.03.27.

#### formulas
#
# libraries
brew 'coreutils'
#
# utilities
brew 'ffmpeg', args: ['--with-libvpx', '--with-libvorbis', '--with-faac']
brew 'gnu-sed'
brew 'htop'
brew 'lnav'
brew 'm-cli'
brew 'mas'	# for Mac App Store
brew 'mobile-shell'
brew 'ngrep'
brew 'neovim'
brew 'pstree'
brew 'reattach-to-user-namespace'	# for using pbcopy, pbpaste, or mas in tmux
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
#
# for programming languages
tap 'dart-lang/dart'
brew 'dart'	# Dart 2.x
# for web development with Dart: https://webdev.dartlang.org/guides/get-started
# $ pub global activate webdev
# $ pub global activate stagehand
brew 'go'
brew 'kotlin'
brew 'node', args: ['--with-full-icu']
brew 'rustup-init'	# $ rustup-init
tap 'kylef/formulae'
brew 'kylef/formulae/swiftenv'
# $ swiftenv install --list
# $ swiftenv install [version]
# $ git clone https://github.com/jinmingjian/sourcekite.git && cd sourcekite && make install
brew 'swiftlint'
#
# for development tools
brew 'curl', args: ['--with-nghttp2']
brew 'git', args: ['--with-pcre']
brew 'git-flow'
brew 'gnupg'
tap 'heroku/brew'
brew 'heroku'
brew 'imagemagick'
brew 'jq'
brew 'mkcert'
brew 'opencv3', args: ['--HEAD', '--with-python3', '--with-ffmpeg', '--with-tbb', '--with-contrib']
brew 'wireshark'
brew 'wrk'

#### cask
#
tap 'caskroom/cask'
#
# utilities
cask 'dropbox'
cask 'google-chrome'
cask 'licecap'
cask 'osxfuse'
cask 'steam'
cask 'visual-studio-code'
cask 'xquartz'
#
# for development
cask 'iterm2'
cask 'java'
#cask 'postico'
cask 'sequel-pro'
cask 'virtualbox'
#
# fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-fira-code'
#
# etc.
#cask 'gureumkim'	# for hangul input


#### for docker and kubernetes
#
# install Docker Desktop from https://download.docker.com/mac/stable/Docker.dmg
brew 'kubernetes-helm'
tap 'wagoodman/dive'
brew 'dive'

