# Brewfile of meinside@gmail.com
#
# Usage: 
#
# $ brew tap Homebrew/bundle
# $ brew bundle
# 
# last update: 2017.07.19.

#### formulas
#
# utilities
brew 'ffmpeg', args: ['--with-libvpx', '--with-libvorbis', '--with-faac']
brew 'htop'
brew 'httpie'
brew 'lnav'
brew 'm-cli'
brew 'mas'	# for Mac App Store
brew 'mobile-shell'
brew 'ngrep'
brew 'neovim'
brew 'pstree'
brew 'reattach-to-user-namespace'	# for using pbcopy, pbpaste, or mas in tmux
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
#
# for development
brew 'curl', args: ['--with-nghttp2']
brew 'coreutils'
brew 'git', args: ['--with-pcre']
brew 'gnupg'
brew 'go'
brew 'go-delve/delve/delve'
brew 'heroku-toolbelt'
brew 'imagemagick'
brew 'jq'
brew 'leiningen'
brew 'node', args: ['--with-full-icu']
brew 'opencv3', args: ['--HEAD', '--with-python3', '--with-ffmpeg', '--with-tbb', '--with-contrib']
brew 'python'
# XXX - needs: brew tap homebrew/science
brew 'r'	# $ defaults write org.R-project.R force.LANG en_US.UTF-8
brew 'wrk'
#
# for building other things (like rubygems)
brew 'libmagic'
brew 'mysql'

#### cask
#
# utilities
cask 'atom'
cask 'resilio-sync'
cask 'dropbox'
cask 'google-chrome'
cask 'licecap'
cask 'osxfuse'
cask 'steam'
cask 'xquartz'
#
# for development
cask 'iterm2'
cask 'java'
cask 'kitematic'
cask 'postico'
cask 'rstudio'
cask 'sourcetree'
cask 'sequel-pro'
cask 'virtualbox'
#
# etc.
cask 'gureumkim'	# for hangul input

