# Brewfile of meinside@gmail.com
#
# Usage: 
#
# $ brew tap Homebrew/bundle
# $ brew bundle
# 
# last update: 2017.09.27.

#### formulas
#
# utilities
brew 'ffmpeg', args: ['--with-libvpx', '--with-libvorbis', '--with-faac']
brew 'htop'
brew 'lnav'
brew 'm-cli'
brew 'mas'	# for Mac App Store
brew 'mobile-shell'
brew 'ngrep'
brew 'neovim'
brew 'pstree'
brew 'reattach-to-user-namespace'	# for using pbcopy, pbpaste, or mas in tmux
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
#
# for development
brew 'curl', args: ['--with-nghttp2']
brew 'coreutils'
brew 'git', args: ['--with-pcre']
brew 'gnupg'
brew 'go'
tap 'go-delve/delve'
brew 'go-delve/delve/delve'
brew 'haskell-stack'
brew 'heroku-toolbelt'
brew 'imagemagick'
brew 'jq'
brew 'node', args: ['--with-full-icu']
brew 'opencv3', args: ['--HEAD', '--with-python3', '--with-ffmpeg', '--with-tbb', '--with-contrib']
brew 'wrk'

#### cask
#
tap 'caskroom/cask'
#
# utilities
cask 'atom'
cask 'resilio-sync'
cask 'dropbox'
cask 'google-chrome'
cask 'licecap'
cask 'osxfuse'
cask 'steam'
cask 'xquartz'
#
# for development
cask 'iterm2'
cask 'java'
cask 'postico'
cask 'sequel-pro'
cask 'virtualbox'
#
# fonts
tap 'caskroom/fonts'
cask 'font-hack'
cask 'font-fira-code'
#
# etc.
#cask 'gureumkim'	# for hangul input

